#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.random[1]: Refreshing state... [id=735905]
random_string.random[2]: Refreshing state... [id=991123]
random_string.random[0]: Refreshing state... [id=920455]
data.google_billing_account.billing: Reading...
data.google_organization.vytrac_me: Reading...
data.google_organization.vytrac_me: Read complete after 0s [id=organizations/222061260236]
data.google_billing_account.billing: Read complete after 1s [id=012AF6-DBCAAF-ADA2BC]
google_project.homelab_dev: Refreshing state... [id=projects/homelab-dev-735905]
google_project.homelab_prod: Refreshing state... [id=projects/homelab-prod-991123]
google_project.admin: Refreshing state... [id=projects/admin-920455]
data.google_secret_manager_secret_version.cloudflare_api_token: Reading...
google_project_service.admin_services["cloudkms.googleapis.com"]: Refreshing state... [id=325329770668/cloudkms.googleapis.com]
google_project_service.admin_services["cloudbilling.googleapis.com"]: Refreshing state... [id=325329770668/cloudbilling.googleapis.com]
google_project_service.admin_services["serviceusage.googleapis.com"]: Refreshing state... [id=325329770668/serviceusage.googleapis.com]
google_project_service.admin_services["iam.googleapis.com"]: Refreshing state... [id=325329770668/iam.googleapis.com]
google_project_service.admin_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=325329770668/cloudresourcemanager.googleapis.com]
google_project_service.admin_services["secretmanager.googleapis.com"]: Refreshing state... [id=325329770668/secretmanager.googleapis.com]
google_project_service.admin_services["storage.googleapis.com"]: Refreshing state... [id=325329770668/storage.googleapis.com]
data.google_secret_manager_secret_version.github_domain_verifications: Reading...
google_service_account.tf_sa: Refreshing state... [id=projects/admin-920455/serviceAccounts/gitops-iac@admin-920455.iam.gserviceaccount.com]
google_kms_key_ring.keyring: Refreshing state... [id=projects/admin-920455/locations/us-central1/keyRings/homelab-keyring]
data.google_secret_manager_secret_version.github_domain_verifications: Read complete after 0s [id=projects/325329770668/secrets/github-domain-verifications/versions/1]
data.google_secret_manager_secret_version.gcloud_domain_verifications: Reading...
data.google_secret_manager_secret_version.cloudflare_api_token: Read complete after 0s [id=projects/325329770668/secrets/cloudflare-api-token/versions/1]
google_service_account_key.tf_sa_key: Refreshing state... [id=projects/admin-920455/serviceAccounts/gitops-iac@admin-920455.iam.gserviceaccount.com/keys/25d95a9f9a8373f6213c1daada502f1c1f0f57fb]
google_organization_iam_binding.tf_sa_binding["roles/billing.viewer"]: Refreshing state... [id=222061260236/roles/billing.viewer]
google_project_iam_binding.tf_sa_binding["roles/cloudkms.admin"]: Refreshing state... [id=325329770668/roles/cloudkms.admin]
data.google_secret_manager_secret_version.gcloud_domain_verifications: Read complete after 0s [id=projects/325329770668/secrets/gcloud-domain-verifications/versions/1]
google_project_iam_binding.tf_sa_binding["roles/secretmanager.secretAccessor"]: Refreshing state... [id=325329770668/roles/secretmanager.secretAccessor]
google_project_iam_binding.tf_sa_binding["roles/secretmanager.viewer"]: Refreshing state... [id=325329770668/roles/secretmanager.viewer]
google_project_iam_binding.tf_sa_binding["roles/storage.admin"]: Refreshing state... [id=325329770668/roles/storage.admin]
google_organization_iam_binding.tf_sa_binding["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=222061260236/roles/iam.serviceAccountAdmin]
google_organization_iam_binding.tf_sa_binding["roles/iam.serviceAccountKeyAdmin"]: Refreshing state... [id=222061260236/roles/iam.serviceAccountKeyAdmin]
google_organization_iam_binding.tf_sa_binding["roles/resourcemanager.organizationAdmin"]: Refreshing state... [id=222061260236/roles/resourcemanager.organizationAdmin]
google_organization_iam_binding.tf_sa_binding["roles/resourcemanager.projectCreator"]: Refreshing state... [id=222061260236/roles/resourcemanager.projectCreator]
google_organization_iam_binding.tf_sa_binding["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=222061260236/roles/resourcemanager.projectIamAdmin]
google_organization_iam_binding.tf_sa_binding["roles/serviceusage.serviceUsageAdmin"]: Refreshing state... [id=222061260236/roles/serviceusage.serviceUsageAdmin]
google_kms_crypto_key.secrets_key: Refreshing state... [id=projects/admin-920455/locations/us-central1/keyRings/homelab-keyring/cryptoKeys/secrets-key]
google_kms_crypto_key.tfstate_key: Refreshing state... [id=projects/admin-920455/locations/us-central1/keyRings/homelab-keyring/cryptoKeys/tfstate-key]
cloudflare_email_routing_address.email: Refreshing state... [id=232419e353df4c66962536ac35c6b31c]
data.cloudflare_zone.zone: Reading...
google_kms_crypto_key_iam_binding.secrets_sa_binding: Refreshing state... [id=projects/admin-920455/locations/us-central1/keyRings/homelab-keyring/cryptoKeys/secrets-key/roles/cloudkms.cryptoKeyEncrypterDecrypter]
google_kms_crypto_key_iam_binding.tfstate_sa_binding: Refreshing state... [id=projects/admin-920455/locations/us-central1/keyRings/homelab-keyring/cryptoKeys/tfstate-key/roles/cloudkms.cryptoKeyEncrypterDecrypter]
google_storage_bucket.gcs_bucket: Refreshing state... [id=tfstate.vytrac.me]
data.cloudflare_zone.zone: Read complete after 0s [id=a53af84a2f59d2dcf19713b7a04c616c]
cloudflare_page_rule.www: Refreshing state... [id=499701397f31774c253cb6cd37d9e615]
cloudflare_record.root: Refreshing state... [id=b96b0a0dcd2527470dcb9a7460f6e9e3]
cloudflare_record.gcloud_verifications[0]: Refreshing state... [id=b5930144dccfca4af1a6f23136a43193]
cloudflare_record.gcloud_verifications[1]: Refreshing state... [id=8161e4e15a36bc464f8bd68cead33d13]
cloudflare_record.mail["0"]: Refreshing state... [id=e6502757e33c4330484806c39466dc0c]
cloudflare_record.mail["1"]: Refreshing state... [id=8cf323c167727bb8d64853dc313f42e1]
cloudflare_record.notes: Refreshing state... [id=2d9ab04912f7aa67c8d979e3fd40601d]
cloudflare_record.spf: Refreshing state... [id=14751139d6392c51051de019a32fdee6]
cloudflare_record.mail["2"]: Refreshing state... [id=c0366e4f58c493a1b29158ba19dadbff]
cloudflare_record.tilde: Refreshing state... [id=64ff826f2a3e121810813d1fdb8bce2c]
cloudflare_record.www: Refreshing state... [id=a73a91c2e993a2e7cc2917a6d9111078]
cloudflare_record.dmarc: Refreshing state... [id=6aabe3e9dc6e384483381754ea508057]
cloudflare_email_routing_rule.email: Refreshing state... [id=13666d9008a944c98b0b306dd09418b5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.gh_pages will be created
  + resource "cloudflare_record" "gh_pages" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "web"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "celia-vytrac.github.io"
      + zone_id         = "a53af84a2f59d2dcf19713b7a04c616c"
    }

  # cloudflare_record.github_verifications[0] will be created
  + resource "cloudflare_record" "github_verifications" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_github-pages-challenge-celia-vytrac.web.vytrac.me"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = (sensitive value)
      + zone_id         = "a53af84a2f59d2dcf19713b7a04c616c"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

```

terraform

```

</details>

*Pusher: @celia-vytrac, Action: `pull_request`, Working Directory: `iac/admin`, Workflow: `Terraform CI/CD`*